In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
animals = DataFrame(np.arange(16).reshape(4,4),
                                       columns = list('WXYZ'),
                                       index = ['Dog', 'Cat', 'Bird', 'Mouse'])
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [5]:
animals.loc['Cat', ['W', 'Y']]= np.nan
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [6]:
behavior_map = {'W': 'bad', 'X': 'good', 'Y': 'bad', 'Z': 'good'}

In [13]:
for name, gr in animals.groupby(behavior_map, axis = 1):
    print(name, gr, sep='\n')
    print('---')

bad
          W     Y
Dog     0.0   2.0
Cat     NaN   NaN
Bird    8.0  10.0
Mouse  12.0  14.0
---
good
        X   Z
Dog     1   3
Cat     5   7
Bird    9  11
Mouse  13  15
---

In [16]:
animal_col = animals.groupby(behavior_map,axis=1)
animal_col.sum()

        bad  good
Dog     2.0   4.0
Cat     0.0  12.0
Bird   18.0  20.0
Mouse  26.0  28.0

In [17]:
befav_series = Series(behavior_map)
befav_series

W     bad
X    good
Y     bad
Z    good
dtype: object

In [18]:
animals.groupby(befav_series, axis=1).count()

       bad  good
Dog      2     2
Cat      0     2
Bird     2     2
Mouse    2     2

In [19]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [20]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [23]:
keys = list('AAAB')
keys
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   5   2.0   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15